
function cz_使用装备(){
    let 大图范围 = [943,511,987,533]
    let 小图路径 = "使用.png"
    let 是否找到 = ff_识图_是否(大图范围[0],大图范围[1],大图范围[2],大图范围[3],小图路径)
    if(是否找到){
        ff_点击(966,523)
        logw("使用")
    }
    image.recycle(image)
}

function cz_回收(){
    let 采样_坐标 = {
        "背包":[1238,265]
    }
    let 采样_图片 = {
        "仓库按钮小图":"按钮-仓库.png"
    }


    // 打开背包
    ff_点击(采样_坐标["背包"][0],采样_坐标["背包"][1])  // 打开背包

    // 回到标准位置，打开仓库
    let point = ff_定位元素(0,0,0,0,采样_图片["仓库按钮小图"])
    if (!point){
        loge("仓库按钮未定位到")
        return;
    }else{
        //logw("仓库元素" + JSON.stringify(point)) ; logw(point["left"],point["top"]) ; logw("点击")
        logw("回收一系列操作")
        ff_点击(point["left"], point["top"])  // 打开仓库
        // tool_drawDebugBox(point["left"],point["top"],point["right"],point["bottom"])

    }

    // 满足条件，则回收
    let a = ff_识图_是否(669,407,734,471,"空背包栏.png")
    tool_drawDebugBox(667,405,734,470)
    if (a) { // 找到这个是一个空背包
        logw("背包未到达回收要求")
        ff_点击(614, 100)  //关闭仓库
        ff_点击(1256, 116)  // 关闭背包
        return;
    }else{
        logw("回收操作")
        ff_点击(1016, 499)  // 点击回收
        ff_点击(606, 581)   // 点击一件回收
        ff_点击(964, 111)   // 关闭回收窗口,去掉3s提示
        ff_点击(964, 111)   // 关闭回收窗口
        ff_点击(796,593)    // 点击整理
        ff_点击(1256, 116)  // 关闭背包
        ff_点击(614, 100)   //关闭仓库
    }

    sleep(2000);



    /*
    let 是否找到 = ff_识图_是否(大图范围[0],大图范围[1],大图范围[2],大图范围[3],小图路径)
    if(是否找到){
        ff_点击(1238,265)  // 打开背包
        ff_点击(569,494) // 点击回收
        ff_点击(616,584) // 一键回收
        ff_点击(971,119,2) // 关闭回收窗口,去掉3s提示
        ff_点击(971,119) // 关闭回收窗口
        ff_点击(346,576) // 整理
        ff_点击(831,117) // 关闭背包
    }
    image.recycle(image)
    */

}